In [1]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

Q1. List any five functions of the pandas library with execution.

1. **.head():** Returns the first n rows of a DataFrame, by default n=5.

In [2]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

2. **.describe():** Generates descriptive statistics of a DataFrame, including count, mean, standard deviation, minimum, maximum, and quartiles.

In [3]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

3. **.groupby():** Groups a DataFrame by one or more columns, allowing for aggregations and transformations to be applied to each group.

In [4]:
df_grouped=df.groupby('Age')
df_grouped.first()

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Age,,,,,,,,,,,
0.42,804,1,3,"Thomas, Master. Assad Alexander",male,0,1,2625,8.5167,None,C
0.67,756,1,2,"Hamalainen, Master. Viljo",male,1,1,250649,14.5000,None,S
0.75,470,1,3,"Baclini, Miss. Helene Barbara",female,2,1,2666,19.2583,None,C
0.83,79,1,2,"Caldwell, Master. Alden Gates",male,0,2,248738,29.0000,None,S
0.92,306,1,1,"Allison, Master. Hudson Trevor",male,1,2,113781,151.5500,C22 C26,S
...,...,...,...,...,...,...,...,...,...,...,...
70.00,673,0,2,"Mitchell, Mr. Henry Michael",male,0,0,C.A. 24580,10.5000,B22,S
70.50,117,0,3,"Connors, Mr. Patrick",male,0,0,370369,7.7500,None,Q
71.00,97,0,1,"Goldschmidt, Mr. George B",male,0,0,PC 17754,34.6542,A5,C
74.00,852,0,3,"Svensson, Mr. Johan",male,0,0,347060,7.7750,None,S
80.00,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,0,0,27042,30.0000,A23,S

4. **.fillna():** Fills missing values in a DataFrame with a specified value or method, such as forward or backward filling.

In [5]:
df['Age'].fillna('Missing', inplace = True)

In [6]:
df['Age'].isna().sum()

0

5. **df.info():** Displays a summary of the DataFrame, including the column names, data types, number of non-null values, and memory usage.

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    object
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(1), int64(5), object(6)
memory usage: 83.7+ KB

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [9]:
data = {'A': [1, 2, 3, 4, 5,1, 2],
        'B': ['a', 'b', 'c', 'd', 'e','a', 'b'],
        'C': [1.1, 2.2, 3.3, 4.4, 5.5,1.1, 2.2]}
df = pd.DataFrame(data)
df

   A  B    C
0  1  a  1.1
1  2  b  2.2
2  3  c  3.3
3  4  d  4.4
4  5  e  5.5
5  1  a  1.1
6  2  b  2.2

In [10]:
new_index=list(range(1,2*len(df),2))
new_index

[1, 3, 5, 7, 9, 11, 13]

In [11]:
df.index=new_index
df

    A  B    C
1   1  a  1.1
3   2  b  2.2
5   3  c  3.3
7   4  d  4.4
9   5  e  5.5
11  1  a  1.1
13  2  b  2.2

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [12]:
data = {'Values': [10, 20, 30, 40, 50],
        'B': ['a', 'b', 'c', 'd', 'e'],
        'C': [1.1, 2.2, 3.3, 4.4, 5.5]}
df = pd.DataFrame(data)
df

   Values  B    C
0      10  a  1.1
1      20  b  2.2
2      30  c  3.3
3      40  d  4.4
4      50  e  5.5

In [13]:
def sum_col(df):
    sum = 0
    count = 0
    for each_value in df['Values']:
        sum = sum+each_value
        count+=1
        if count>=3:
            break
    return sum

In [14]:
sum_col(df)

60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [15]:
data = {'Text': ['Harry','Sally','Bob','Lukas','Timothy']}
df = pd.DataFrame(data)
df

      Text
0    Harry
1    Sally
2      Bob
3    Lukas
4  Timothy

In [16]:
word_count=[]
for each_text in df['Text']:
    word_count.append(len(each_text))
df['Word_Count']=word_count
df

      Text  Word_Count
0    Harry           5
1    Sally           5
2      Bob           3
3    Lukas           5
4  Timothy           7

Q5. How are DataFrame.size() and DataFrame.shape() different?

**DataFrame.size** is an attribute that returns the total number of elements in the DataFrame. It is calculated as the product of the number of rows and columns in the DataFrame.

In [17]:
df.size

10

**DataFrame.shape** is an attribute that returns a tuple containing the number of rows and columns in the DataFrame. The number of rows is the first element of the tuple, and the number of columns is the second element of the tuple.

In [18]:
df.shape

(5, 2)

Q6. Which function of pandas do we use to read an excel file?

The **pandas.read_excel()** function of pandas is used to read an excel file.

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [19]:
data = {'Email': ['John.doe@gmail.com','Sally.carpenter@gmail.com','Bob@gmail.com','Lukas.speed@gmail.com','Timothy@gmail.com']}
df = pd.DataFrame(data)
df

                       Email
0         John.doe@gmail.com
1  Sally.carpenter@gmail.com
2              Bob@gmail.com
3      Lukas.speed@gmail.com
4          Timothy@gmail.com

In [20]:
usernames = []
for each_email in df['Email']:
    name = each_email.split('@')
    usernames.append(name[0])

In [21]:
df['Username']=usernames
df

                       Email         Username
0         John.doe@gmail.com         John.doe
1  Sally.carpenter@gmail.com  Sally.carpenter
2              Bob@gmail.com              Bob
3      Lukas.speed@gmail.com      Lukas.speed
4          Timothy@gmail.com          Timothy

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [22]:
data = {
    'A': [3, 8, 6, 2, 9],
    'B': [5, 2, 9, 3, 1],
    'C': [1, 7, 4, 5, 2],
}
df = pd.DataFrame(data)
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [23]:
def func(df):
    i = 0
    index=[]
    for elem_A, elem_B in zip(df['A'],df['B']):
        if elem_A>5 and elem_B<10:
            index.append(i) 
        i+=1
    new_df = df.loc[index]
    return new_df

In [24]:
new_df = func(df)
new_df

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [26]:
data = {'Values': [10, 20, 30, 40, 50]}
df = pd.DataFrame(data)
df

   Values
0      10
1      20
2      30
3      40
4      50

In [27]:
def calc_stats(df):
    mean = df['Values'].mean()
    median = df['Values'].median()
    std = df['Values'].std()
    return mean, median, std
mean,median,std = calc_stats(df)
print(f'Mean: {mean},\nMedian: {median},\nStandard Deviation: {std}')

Mean: 30.0,
Median: 30.0,
Standard Deviation: 15.811388300841896

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [28]:
data = {'Sales': [1.1, 2.2, 3.3, 4.4, 5.5,1.1, 2.2,1.1, 2.2, 3.3, 4.4, 5.5,1.1, 2.2]}
df = pd.DataFrame(data)
df.head()

   Sales
0    1.1
1    2.2
2    3.3
3    4.4
4    5.5

In [29]:
def moving_average(df):
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    return df

In [30]:
new_df = moving_average(df)
new_df.head()

   Sales  MovingAverage
0    1.1           1.10
1    2.2           1.65
2    3.3           2.20
3    4.4           2.75
4    5.5           3.30

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

In [31]:
data = {'Date': ['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05', '2023-01-06']}
df = pd.DataFrame(data)
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06

In [32]:
def weekday_func(df):
    weekdays=[]
    for each_date in df['Date']:
        temp = each_date.split('-')
        if temp[2]=='01':
            weekdays.append('Sunday')
        elif temp[2]=='02':
            weekdays.append('Monday')            
        elif temp[2]=='03':
            weekdays.append('Tuesday')
        elif temp[2]=='04':
            weekdays.append('Wednesday')
        elif temp[2]=='05':
            weekdays.append('Thursday')
        elif temp[2]=='06':
            weekdays.append('Friday')        
    df['Weekdays'] = weekdays
    return df

In [33]:
new_df = weekday_func(df)
new_df

         Date   Weekdays
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday
5  2023-01-06     Friday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [34]:
data = {'Date': ['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05', '2023-01-06']}
df = pd.DataFrame(data)
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06

In [35]:
def selected_dates(df):
    start_date = '2023-01-03'
    end_date = '2023-01-05'
    mask = (df['Date'].dt.date >= pd.to_datetime(start_date).date()) & (df['Date'].dt.date <= pd.to_datetime(end_date).date())
    return df.loc[mask]

In [36]:
df['Date'] = pd.to_datetime(df['Date'])
new_data = selected_dates(df)
new_data

        Date
2 2023-01-03
3 2023-01-04
4 2023-01-05

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

The first and foremost necessary library that needs to be imported to use the basic functions of Pandas is the Pandas library itself.

In [37]:
import pandas as pd